Revit 2027 API
MassInstanceUtils.GetGrossVolume Method
 Get the total building volume represented by a mass instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static double GetGrossVolume(
	Document document,
	ElementId massInstanceId
)
Public Shared Function GetGrossVolume (
	document As Document,
	massInstanceId As ElementId
) As Double
public:
static double GetGrossVolume(
	Document^ document,
	ElementId^ massInstanceId
)
static member GetGrossVolume :
        document : Document *
        massInstanceId : ElementId -> float
Parameters
document Document
 The Document.
massInstanceId ElementId
 The ElementId of the mass instance.
Return Value
Double
 The gross volume in cubic feet.
Exceptions
Exception | Condition
ArgumentException |  The ElementId massInstanceId is not a mass instance.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MassInstanceUtils Class
Autodesk.Revit.DB Namespace